<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads outset and renames with version. No repackaging done.</string>
	<key>Identifier</key>
	<string>com.github.patgmac.pkg.outset</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>outset</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.grahamgilbert.download.outset</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			<key>warning_message</key>
            <string>This recipe has been deprecated. See issue for further details: https://github.com/autopkg/grahamgilbert-recipes/issues/57

New recipes can be found here: https://github.com/autopkg/dataJAR-recipes/tree/master/Outset</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
