<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Specify HOSTNAME for your Netskope tenant.</string>
	<key>Description</key>
	<string>Downloads latest version of Netskope from your tenant.</string>
	<key>Identifier</key>
	<string>com.github.patgmac.download.Netskope</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://%HOSTNAME%/dlr/win/get</string>
		<key>HOSTNAME</key>
		<string>download-company.goskope.com</string>
		<key>NAME</key>
		<string>NSClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prefetch_filename</key>
				<true/>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>msi_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
