<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Autopkg recipe to add Audacity updates to LANrev</string>
	<key>Identifier</key>
	<string>com.github.patgmac.lanrev.Audacity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Audacity</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.scriptingosx.pkg.audacity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dest_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.amsdpackages</string>
				<key>import_pkg_to_servercenter</key>
				<true/>
				<key>sdpackages_ampkgprops_path</key>
				<string>%RECIPE_DIR%/%NAME%-Defaults.ampkgprops</string>
				<key>source_payload_path</key>
				<string>%pkg_path%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.jbaker10.LANrevImporter/LANrevImporter</string>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/jbaker10/LANrevImporter</string>
		</dict>
	</array>
</dict>
</plist>
