<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of CrystalDiffract and creates a package. This recipe does download the current version with each autopkg run. It is not doing any version checking before downloading.</string>
	<key>Identifier</key>
	<string>com.github.patgmac.pkg.CrystalDiffract</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CrystalDiffract</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.patgmac.download.CrystalDiffract</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/CrystalDiffract.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
