<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Prisma Access Browser and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.patgmac-recipes.munki.PrismaAccessBrowser</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>PrismaAccessBrowser</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Updater.app</string>
				<string>Prisma Access Browser Helper (Renderer).app</string>
				<string>Prisma Access Browser Helper (Alerts).app</string>
				<string>Prisma Access Browser.app</string>
				<string>PrismaAccessBrowserSoftwareUpdateAgent.app</string>
				<string>Prisma Access Browser Helper (Plugin).app</string>
				<string>Prisma Access Browser Helper.app</string>
				<string>Prisma Access Browser Helper (GPU).app</string>
				<string>PrismaAccessBrowserUpdater.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Prisma Access Browser extends SASE protection seamlessly to every device, bringing unmatched agility, security, and control to your business.</string>
			<key>developer</key>
			<string>Palo Alto Networks</string>
			<key>display_name</key>
			<string>Prisma Access Browser</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.patgmac-recipes.download.PrismaAccessBrowser</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
